2010-01-01,元日
2010-01-06,十二日節
2010-05-01,メーデー
2010-12-06,独立記念日
2010-12-24,クリスマス イブ
2010-12-25,クリスマス
2010-12-26,ボクシング デー
2011-01-01,元日
2011-01-06,十二日節
2011-05-01,メーデー
2011-12-06,独立記念日
2011-12-24,クリスマス イブ
2011-12-25,クリスマス
2011-12-26,ボクシング デー
2012-01-01,元日
2012-01-06,十二日節
2012-04-06,聖金曜日
2012-04-08,イースター（復活祭）
2012-04-09,復活祭の翌日
2012-05-01,メーデー
2012-05-17,昇天祭
2012-05-27,聖霊降臨祭
2012-06-22,夏至前夜祭
2012-06-23,夏至祭
2012-11-03,万聖節
2012-12-06,独立記念日
2012-12-24,クリスマス イブ
2012-12-25,クリスマス
2012-12-26,ボクシング デー
